[
  {
    "title":"Arbor Haven Proposal Greatly Exaggerates Tax Revenues",
    "author":"Lou Ruotolo",
    "date": "4/14/22",
    "url":"https://woodbridgetownnews.com/letter-arbor-haven-proposal-greatly-exaggerates-tax-revenues/",
    "content":"The Arbor Haven proposal estimates net revenue to the town of $1.28 million per year.  A closer review shows this estimate exaggerates the expected tax revenues by $825,000 per year.  Comparing Arbor Haven’s tax estimates to taxes paid for similar sized homes in Woodbridge shows huge discrepancies.  As an example, the developer estimates $19,247 in yearly tax revenues for a 2000 sq ft home and $21,171 for a 3000 sq ft home!  The average in Woodbridge is only $11,000 and $13,200 respectively!  The developer bases its tax revenue calculations on sales price; however, that is not how tax assessments are calculated.  The following details how I arrived at my estimates.\n\nMy calculation for tax revenues were approximated by sampling the town assessor’s records for the size of homes proposed to be built and compared that to the estimates in the Arbor Haven proposal.  Arbor Haven stated that 2-bedroom homes would be about 2,000 sq ft, 3 bedrooms about 3,000 sq ft and 4 bedrooms about 4000+ sq ft.  I sampled the assessor’s tax records for at least 30 homes in each of those size categories for a total of 95 homes to determine the average tax paid for each size category.  The homes selected were from various areas of town on the most upscale streets in those areas.  When applying my estimates to the quantity of houses specified in the Arbor Haven proposal, I found the tax revenues were overestimated by approximately $825,000 per year.  I could only find one home out of 95 sampled to match the average estimated by Arbor Haven!  This correction alone reduces the estimated net revenue to the town to $455,000 per year.  I reviewed this process with our town assessor and she agreed that this was a reasonable approach to estimate the expected taxes.\n\nAdditionally, costs in the proposal are greatly underestimated.  The proposal uses country wide averages for the number of additional children expected to be added to our schools.  People are attracted to Woodbridge because of the schools, not the night life, restaurants or shopping…we have none!  The number of expected school children should be based on recent demographic history for new residents to Woodbridge.  We are also risking having to expand the Beecher Road school system.  Having to expand the school and add staff would far exceed any excess dollars available from retiring the CCW debt.\n\nThe Arbor Haven proposal also contains another major error as it does not include costs for Fire, Police, roads, library, and general administration.  The Woodbridge Finance Director estimates this cost to be approximately $2,000 per person per year.  Even a minimum of 300 extra residents would add $600,000 in yearly expenses.  When cost estimates are adjusted to account for these additional expenses and a realistic number of school children, I believe the net deficit from this project could be as high as $1million per year.\n\nRemember these are estimates.  There is nothing to prevent the mix of housing to change.  If the tax revenues were to go down and expenses go up even slightly. this project would generate an even larger annual deficit.  The Selectwoman decided to support the Arbor Haven proposal because she received many calls and e-mails from residents in favor of this proposition; however, those opinions are ill informed.  She also claims we need to expand the Grand List to combat rising costs.  This project is not doing that.  Before a proposal can be put to referendum, we need a complete and accurate financial impact assessment performed by an independent, non biased source.  Arbor Haven is not that source.  It is not fair to expect the town residents to make such an impactful decision based on such an imprecise financial analysis."
  },
  {
    "title": "Decades of Inattention, Delay, and Inaction Have Brought us to this Point",
    "author": "Jeff Hellman",
    "date": "4/14/22",
    "url": "https://woodbridgetownnews.com/letter-decades-of-inattention-delay-and-inaction-have-brought-us-to-this-point/",
    "content":"I have read Woodbridge First Selectman Beth Heller’s columns about why town residents should consider selling the Country Club of Woodbridge property.  What I have noticed is a stunning lack of leadership, vision, and accountability.\n\nAffordable housing options are necessary, but Ms. Heller’s single-minded mad dash to sell the Country Club is short-sighted, ill-conceived, and based on a misunderstanding of state law.  She wrongly believes that the town is under an urgent legal obligation to provide affordable housing.  No law requires any town to build or devote public land to housing.  She says that 10% of Woodbridge’s housing must be affordable; again, that is an incorrect reading of General Statute section 8-30g (the affordable housing appeals procedure.)  Enacted in 1989, section 8-30g provides that when a town in which less than 10% of the housing stock is affordable denies an affordable housing application, the town must have significant public health, safety, and welfare reasons to defend its decision in court successfully.  The purpose of 8-30g is not and never has been to get all towns to the 10% threshold.  Meeting the town’s housing needs is important, but the larger question is why our leaders have not done more to meet this need in the 30 years since section 8-30 g’s passage?  The one-time sale of a public asset to address our housing needs is no substitute for inspired and inspirational leadership.\n\nOur leaders have been slow to take the initiative and implement change.  In 2017, the State required towns to create and adopt affordable housing plans by 2022.  Woodbridge waited until late May 2021 to create a Housing Opportunity Study Committee to help meet this obligation.  In June 2021, the town amended its zoning regulations to provide more multi-family and affordable housing options, but only after being threatened with legal action.  New state laws require towns to enact zoning regulations to facilitate housing choice but allow them to opt-out of some of the requirements before January 1, 2023.  Let’s hope that the Town Plan and Zoning Commission took a more thoughtful and proactive approach when it revised our zoning regulations than the Board of Selectmen is taking to the Country Club property.\n\nMs. Heller tells us that selling the Country Club will stabilize our tax base, keep the mill rate in check, and help fund town services.  The town’s reliance on residential and motor vehicle taxes to fund its operations and the inadequacies of that approach are well-known.  A land sale may provide some quick cash, but will create more town expenses in the long term.  Selling the Country Club is an imperfect and temporary fix that cannot compensate for the lack of past, present and future economic planning.\n\nDecades of inattention, delay, and inaction have brought us to this point.  Ms. Heller says that she is committed to controlling the development of the property and letting voters decide.  That may be, but her reasons for wanting to sell the Country Club are poor substitutes for comprehensive and well-thought-out land use and economic development planning."
  },
  {
    "title": "The Arbor Haven Development Makes No Financial Sense for Taxpayers",
    "author": "Paul Harrigan",
    "date": "4/14/22",
    "url": "https://woodbridgetownnews.com/letter-the-arbor-haven-development-makes-no-financial-sense-for-taxpayers/",
    "content":"I’m concerned that the Board of Selectmen has not done basic due diligence on the proposed Arbor Haven development at the former Country Club of Woodbridge (CCW).  The First Selectman has promoted the project as a windfall to taxpayers, but nothing could be further from the truth.  Town officials have not questioned the developer’s inflated estimate of tax revenue to the town and the developer’s blatantly inaccurate assessment of educational costs that will result.  The developer’s financial analysis is riddled with errors and inappropriate assumptions.\n\nArbor Haven uses generic national averages to estimate the number of school age children who will be added to our school system if its subdivision is built.  Seeking data that is specific to Woodbridge, I surveyed the top Real Estate Brokers at the two largest real estate agencies in town.  The Brokers described their typical Woodbridge buyer as “someone seeking a home with a large yard for their kids to play in and to be in the Woodbridge school system.”  They all said that their typical Woodbridge home buyer on average has 2 young children.  We all know, based on our own neighborhoods, that most Woodbridge homebuyers are young families with school age children.  On one street near me, a third of the homes have been sold in the past two years, and all of the new families have at least two children.  It’s interesting to note that the developer originally estimated 153 students in their initial presentation, but after being told that our cost per student is much higher than their estimated cost, they simply reduced their estimated number of students by half seemingly to solve for their desired answer.\n\nThe cost to taxpayers will be over $3million in additional school costs for these new families.  Also omitted from Arbor Haven’s analysis are the costs for other town services such as police, fire, roads, etc. which, according to the Town Finance Director’s formula, will add at least $600,000 in annual expenses, bringing the costs up over $3.6million per year.  This number exceeds even the overly optimistic revenue estimates by Arbor Haven ($2.7million), guaranteeing a deficit to the Town of nearly $1million per year if this proposal is built.\n\nA project that “grows” the grand list does not benefit taxpayers if the expenses exceed the tax revenue generated from the project.  This is similar to the conclusion that consultants Milone and MacBroom made in a study the Town of Woodbridge commissioned in 2014.  In that study they estimated that a smaller 65-unit residential development at the CCW would net the town a $554,000 deficit per year in 2014 dollars.  It is abundantly obvious the expenses to the town exceed the potential tax revenue and will increase the mill rate long term.  This development proposal only benefits the developer and not Woodbridge taxpayers.  I implore the Board of Selectmen to go back and do its due diligence on this project before wasting more taxpayers’ money promoting a bad idea."
  },
  {
    "title": "Will The Supporters of the Arbor Haven Proposals Please Tell Me I Am Wrong",
    "author": "Kevin Tatro",
    "date": "4/14/22",
    "url": "https://woodbridgetownnews.com/letter-will-the-supporters-of-the-arbor-haven-proposals-please-tell-me-i-am-wrong/",
    "content":"The lead developer of Arbor Haven is Harvey Shapiro.  The presentation indicates he has developed 2000 residential units, yet the only mention of any development experience listed on the Arbor Haven website refers to a seven-lot development of multi-million-dollar homes in the Hamptons for which I can find no evidence of his involvement.  My research revealed only one other project developed by a Harvey Shapiro that was a failed project in New York called Riverwoods Chappaqua, that was foreclosed and was later involved a Rico lawsuit.  I’m sure the folks pushing for this proposal can show me I’ve just done a bad job researching Mr. Shapiro.\n\nBut what of Joseph Amico who is listed as the Co-GP?  He lists strong experience as the developer of a 122-unit condominium project identified as Salina Crossings that was breaking ground last summer.  What I find is that the Salina Crossing project was killed back in 2020 and that the development entity was dissolved in August 2021.  Again, somebody should correct me on this if I am wrong.\n\nOr how about their General Counsel Bruce F. Caputo?  The only info I could find on him was when he was a congressman in NY, he was referred to as “…the scourge of the ethics committee…”.  He later dropped out of politics as on numerous occurrences he claimed to be a lieutenant in the Vietnam war, but later admitted, oops, I never was in the military.\n\nI’m sure I must be wrong on all of this as the folks running our town and pushing for this developer are certain to have been assured that we would be working with an experienced team of high ethical standards.  After all, I only spent fifteen minutes on the internet to find this info."
  },
  {
    "title": "What Happened to the \"Pause?\" What’s the Rush? Town Needs a Comprehensive Planning Process",
    "author": "Al Smith",
    "date": "2/10/22",
    "url": "https://woodbridgetownnews.com/letter-what-happened-to-the-pause-whats-the-rush-town-needs-a-comprehensive-planning-process/",
    "content": "Like many others, I am dismayed by the precipitous action of our Board of Selectmen (BOS) in ending, without notice, its stated intention to “pause” consideration of selling the Country Club of Woodbridge Property.\n\nAs reported in this publication on December 17, 2021, First Selectman Heller recently stated, “I believe it’s in the best interest of the town to hold off…with any proposal at this time,” she said.  She hopes that the right person will assist the Board of Selectmen to develop a comprehensive plan that residents can support.  “This is a proactive way for us to determine the future for our town.”\n\nA few short weeks later, the promised “pause” was reversed without explanation, without the hiring of the “right person,” without the development of a comprehensive plan, without consideration by the Housing Opportunity Study Committee (which, presumably, was created to review proposals such as this), without referral to the 2030 Task Force (charged with brainstorming ways to diversify the Town’s grand list), and without inclusion in the recently begun Strategic Planning process.\n\nBy unhappy coincidence, the BOS decision to discard its prior pledges came immediately after it again became necessary to restrict public participation due to COVID resurgence.  It would be unfortunate if the BOS, in its apparent haste to make a deal, would push forward without the analysis it previously identified as necessary at a time when the public’s ability to hear and be heard on the largest development in the Town’s history is constrained by COVID.\n\nThis is to request that the BOS resume the pause and use the time to:\n\nFulfill its pledge to obtain the advice of the “right person” or persons to guide us through these important issues. There seems to be considerable disagreement as to the revenues (e.g. taxes) and expenses (e.g. education, improvements and maintenance) associated with Arbor Haven and other developments.  This advisor should develop a “build-out analysis” reflecting the recent changes to the zoning regulations that now allow major residential development with unprecedented density in every neighborhood.\n\nRefer the matter to the 2021 Housing Committee. Otherwise, why have it?\n\nFully consider other proposals for use of the property including the offer from the Woodbridge Land Trust and the Woodbridge Park Association to purchase a conservation restriction.\n\nThe BOS was wise in deferring consideration of the Arbor Haven proposal pending a reasoned evaluation of potential development of that and other properties in Town.  One wishes that they would stand by that pledge."
  },
  {
    "title": "Land Trust and Park Association Presidents State Position on Housing Options in Woodbridge",
    "author": "Bryan Pines and Chris Dickerson",
    "date": "1/13/22",
    "url": "https://woodbridgetownnews.com/letter-land-trust-park-association-presidents-state-position-on-housing-options-in-woodbridge/",
    "content": "We were dismayed to read a recent letter suggesting that the Woodbridge Land Trust and the Woodbridge Park Association are attempting to thwart diverse housing options in Woodbridge by proposing to protect the Roger Sherman Farm located on the Country Club of Woodbridge property.  The goal of our organizations is to protect a historic, ecologically and environmentally significant parcel of open space land, a precious, finite natural resource.  We do not believe that protecting open space and promoting diverse housing are mutually exclusive.  Our town can, and should, do both.\n\nThe State of Connecticut recognizes the importance of both of these goals, and does not place them in conflict with one another.  The State actively encourages towns and non-profit land trusts to protect open space, recreational, and agricultural lands by funding this protection with many millions of dollars every year through grants awarded by the Department of Agriculture (DOAG) and the Department of Energy and Environmental Protection (DEEP).\n\nWe in Woodbridge are fortunate to have a few remaining large open space land parcels.  Many towns, especially those so close to a city, don’t have the same ability to preserve open space.  Providing housing opportunities is about more than building homes, it is building them in communities where people want to live.  Let’s not squander the opportunity to preserve this priceless vanishing asset for the benefit of all members of our community – present and future.\n\n"
  },
  {
    "title": "WLT & WPA Come Together with a Shared Goal",
    "author": "Bryan Pines and Chris Dickerson",
    "date": "1/13/22",
    "url": "https://woodbridgetownnews.com/wlt-wpa-come-together-with-a-shared-goal/",
    "content": "The Woodbridge Land Trust (WLT) and the Woodbridge Park Association (WPA) have come together with a shared goal:  to preserve and protect American patriot Roger Sherman’s Clover Hill Farm (the former Country Club of Woodbridge).  Our two organizations have submitted a formal offer to purchase a grant of conservation restriction on this property, one of the largest, most magnificent parcels of open space land remaining in our town.\n\nThe First Selectman has raised concerns about our plan because she believes it will “tie up” the land.  However, we believe that protecting open space does not tie up land, rather it opens up the land to uses that benefit the entire community.\n\nIn 10, 20, 50, 100 years, do you think anyone will be at all interested in how much it cost to protect this precious natural resource?  The cost is irrelevant – the land is priceless!\n\nWoodbridge residents have an opportunity to do something profound:  protect – forever – a historic farm and beautiful open space land in our town.  In the coming weeks and months, the WLT and WPA plan to provide our neighbors with facts to show that – both short and long term – the only truly viable proposal for the Roger Sherman Farm is our proposal.\n\nEconomically, ecologically, environmentally, historically, psychologically, aesthetically– this property will benefit the residents of Woodbridge far more as protected open space than any of the housing developments proposed over the last twelve years.\n\nStay tuned…"
  },
  {
    "title": "Do the Math Part 2: Marginal Cost Does Not Apply",
    "author": "Cathy Wick",
    "date": "1/13/22",
    "url": "https://woodbridgetownnews.com/letter-do-the-math-part-2-marginal-cost-does-not-apply/",
    "content": "Hillel Auerbach’s recent letter questions my calculations of the cost of adding hundreds of residents to our town if the Arbor Haven proposal goes forward.  He suggests that we should use marginal cost to estimate school expenses.  For two reasons, marginal cost simply does not apply in this case.\n\nThe Amity school system is a regional system, serving three towns.  The Amity school board bills each town on a per student basis – therefore, for each additional student from Woodbridge, the cost to Woodbridge taxpayers increases by $20,000 per year.  There is no such thing as marginal cost in this situation.\n\nThe concept of marginal cost is also inapplicable at Beecher Road school, because we are currently at the enrollment limit – according to the superintendent’s recent statement, we are using “every nook and cranny” in the school building.  Adding the number of students who would result from a large housing development would tip the enrollment over the school building’s physical capacity, necessitating a large infrastructure project.  Building an addition onto the school would cost how much – $30 million?  $40 million?  $50 million?  Certainly, much more than the taxes that could be collected on the homes in question.\n\nIt is a well-known and broadly accepted fact that residential development is profitable only for developers; it has never been, and will never be, financially beneficial for towns.  Indeed, the Highstead Foundation of Redding, CT recently published a paper summarizing 39 separate studies conducted across New England showing how open space land provides financial benefit to towns and residential development creates a financial drain.  Open space benefits towns in many ways – in addition to costing towns much less than residential land, open space mitigates the effects of climate change, raises property values for current homeowners, and enhances quality of life for everyone.  Let’s maintain our quality of life here in Woodbridge by thinking beyond a short-term cash grab and permanently protecting this land.  Future generations will thank us."
  },
  {
    "title": "It’s Time to Undo the \"Bad Deals\"",
    "author": "Hillel Auerbach",
    "date": "12/16/21",
    "url": "https://woodbridgetownnews.com/letter-its-time-to-undo-the-bad-deals/",
    "content": "Cathy Wick asserts the Arbor Haven Proposal will produce a large financial loss for the town.  The Proposal – and Ms Wick – persist in using average costs instead of marginal costs.  That is, what is the cost of adding one more residence and family?\n\nTo determine this, we should look at the families that have moved into Woodbridge in recent years – say, five years – and see how many school-age children they had and have.  For the same period, we can determine how many children attended Woodbridge schools, and what was the percentage of capacity use of our schools.  With this information, we can begin to calculate the costs of an additional 153 students – or however many additional students we may reasonably expect over time.  Similarly, we can estimate the marginal cost of police, library, roads, and general overhead to estimate “the additional cost of adding adult residents to the town” in Ms. Wick words.\n\nIf we “sharpen up our pencils” I am reasonably sure that the deficit projected by Ms. Wick is illusory.  The sale of the land will enable the town to pay off the remaining debt associated with its purchase and have a substantial sum – perhaps $5.5 million – left over to use for town capital projects.  If the Board of Selectmen is interested in this Project, they should prepare the necessary calculations and present them to the voters, with a complete explanation of the assumptions underlying them.\n\nIt was a bad deal for the town when the WCC property was acquired, a bad deal when the town leased the property to a golf club operator, and a worse deal when the town tried to operate a golf course.  It is past time to undo these “bad deals” and put the property to productive use for the benefit of the taxpayers of the town!"
  },
  {
    "title": "Get the Facts",
    "author": "Maria Kayne",
    "date": "12/16/21",
    "url": "https://woodbridgetownnews.com/letter-get-the-facts/",
    "content": "The Earth is round.  Climate change is occurring.  JFK is dead.\n\nThese facts matter.  Let’s get the facts before we decide what to believe about the best future for the Country Club of Woodbridge property.\n\nA couple of years ago, as a member of the Board of Selectmen, I shared a paper with my board colleagues written by Thomas DiNapoli, the New York State Comptroller.  Entitled “Economic Benefits of Open Space Preservation,” this paper systematically explains, from the point of view of a finance expert, why open space is more financially beneficial to municipalities than residential development.\n\nMore recently, the Highstead Foundation of Redding, CT., published “The Economic Case for Conservation.”  Among many facts presented in this paper is a summary of 39 separate studies conducted across New England proving, again and again, that open space land provides financial benefit to towns and residential development creates a financial drain on towns.\n\nTime and again, developers have come to Woodbridge claiming that housing at the CCW will be a financial boon for our town – this is equivalent to claiming that the earth is flat, that climate change is a hoax, and that JFK lives on.  Surprisingly, some of the Selectmen seem to believe these “alternative” facts.\n\nPreserving the CCW land as open space is a financially responsible decision based on facts.  Do facts matter? They must."
  },
  {
    "title": "Reasons Arbor Haven Proposal Should be Rejected",
    "author": "Virginia and David Schneider",
    "date": "12/16/21",
    "url": "https://woodbridgetownnews.com/letter-reasons-arbor-haven-proposal-should-be-rejected/",
    "content": "~Woodbridge is the only town bordering New Haven that is not over developed.\n\n~This unique feature and its rural feeling make Woodbridge a desirable place to live, increasing the value of residential homes.\n\n~The Arbor Haven proposal would undermine what makes Woodbridge special and would drive down residential property values.\n\n~This is merely one reason, among many others, why the Arbor Haven proposal should be rejected.\n\n~Do not be blinded by the siren song of easy money; the Arbor Haven proposal is not good for the Town or for Woodbridge home owners."
  },
  {
    "title": "CCW – What are our Selectmen Doing? – Once Again!",
    "author": "Rich Forselius",
    "date": "12/16/21",
    "url": "https://woodbridgetownnews.com/letter-ccw-what-are-our-selectmen-doing-once-again/",
    "content": "In the Woodbridge Town News edition of November 16, 2018 appeared a letter by me titled “Country Club of Woodbridge – What Are Our Selectmen Doing?”  Most all of what I wrote about at that time is still true today with the misguided potential supported by the First Selectman, the town attorney and other Selectmen to develop the priceless open space at the Country Club of Woodbridge.  I have also written about this being a recurring nightmare.\n\nAt the time, in the “Woodbridge News and Events” for November 2018 under November Planning and Updates, First Selectman Beth Heller wrote about the Former Country Club Property.  She advised then that the Selectmen had received a new proposal for the former Country Club of Woodbridge (CCW) from the developer of Fieldstone Village of Orange.  Now it is a new, unsolicited proposal from new developers interested in building approximately 145 homes on the property being touted by our First Selectman.  If this were to go through it will create enormous challenges for our schools and town services in the years to come.\n\nWhat follows is exactly what I wrote three years ago:\n\n“Simply stated, we need leadership from our town leaders.  It appears the Selectmen are awaiting anyone to send a proposal in to them as to what to do with the former CCW property.  This is not leadership; this is management by incoming letter.\n\n“I am on record in a previous Letter to the Editor, apparently ignored by our Selectmen, for the preservation of the open space of this very historically significant “crown jewel” property.  Any zoning change for this property will have enormous follow-on consequences for other properties in town and bring in housing much more clustered than our present 1½ acre zoning that our town leaders have had the vision to include in our residential zoning regulations for many years.  It is due to this that Woodbridge, although significantly developed, has retained its unique character.\n\n“I informed townspeople about the history of the property deeds for the former CCW and the history of this property.  One-time owners included Captain John Beecher and Patriot & Statesman Roger Sherman.  The Roger Sherman connection to the CCW property is that he owned that property as Clover Hill Farm during the time he served as mayor of New Haven.\n\n“If you do not know who Roger Sherman was, or if you are not aware of the historical significance, I suggest you do your own assessment.  It is easy, start with:  http://www.townhistory.org/clover-hill-farm/.  USA Founding Father Roger Sherman lived from 1721 to 1793 and is the only person to have signed all papers of independence of the United States:  the Continental Association, the Declaration of Independence, the Articles of Confederation and the Constitution.  He was an influential member of the Constitutional Convention and a true statesman.  In 1784, he was the first mayor of New Haven.\n\n“The former CCW property owner prior to Roger Sherman was Captain John Beecher, and his family’s presence on this property prior to the incorporation of the Town of Woodbridge takes us back as far as the founding of New Haven and the original Beecher family in America.  (Think Beecher Road).  If you don’t know of Captain John Beecher, he was an ancestor of Lyman Beecher and his daughter Harriet Beecher Stowe — and her siblings.  The former CCW property was also owned at one time by James Hillhouse; there is so much more about these families in books and references on Woodbridge history.\n\nWe have a very unique opportunity to save this property as was envisioned when the town purchased it and decisions made now will have for-ever consequences.  Please recognize the history of this property, I argue it is the most historically significant location in our town.”\n\nI continue to strongly recommend maintaining the open space of the former golf course, when developed, it will be gone for the public good and historical purposes forever.  An RFP process should be constructed that invites proposals for:\n\nRenovation/replacement of the country club catering/banquet facility for operation as a for-profit property tax-paying venture;\n\nRenovation/replacement of the pool for townspeople summer use, there is no other outdoor town owned pool;\n\nCreate an open space/conservation easement or farmland preservation grant to guarantee operation of the former golf course as a farm; we need more local farms; or just provide for public access and outdoor enjoyment; and\n\nAlternatively consider working with our legislators to create a state park for this parcel to teach our children about history!\n\nAs we know, town leaders have had issues managing the golf course facility under contract to an operating firm.  Town leaders proved that they were unable to manage the golf course either by itself or under contract to a provider.  We must preserve this critical parcel of open space; it is one of the most important opportunities we have at this time to leave a legacy to generations of townspeople to come."
  },
  {
    "title": "Beware of Slick Promises",
    "author": "Amey Marrella",
    "date": "11/17/21",
    "url": "https://woodbridgetownnews.com/letter-beware-of-slick-promises/",
    "content": "In its public presentation on September 29th, potential County Club developer Arbor Haven promised that all new roads would be privately owned and maintained by a homeowners’ association.  However, past experience demonstrates that a homeowners’ association can easily abandon its road responsibilities, cede ownership of the road to the town, and thereby pass the burdensome cost of road maintenance, including snowplowing, onto the town’s taxpayers.  Since this has happened in Woodbridge before, it should be expected to happen again.\n\nArbor Haven also claimed that its new roads would be constructed of permeable material in order to minimize the stormwater runoff impacts of development.  But there is a reason why roads and driveways are generally paved – permeable alternatives readily develop ruts and require frequent attention.  Any new homeowner within an approved Country Club development is likely to want asphalt.\n\nWoodbridge taxpayers should be wary of both promises, as well as any other gimmicks designed to make this development look good."
  },
  {
    "title": "Do the Math: Arbor Haven Proposal will Produce Large Financial Loss for the Town",
    "author": "Cathy Wick",
    "date": "11/17/21",
    "url": "https://woodbridgetownnews.com/letter-do-the-math-arbor-haven-proposal-will-produce-large-financial-loss-for-the-town/",
    "content": "Real estate developer Arbor Haven has proposed to purchase 100 acres of the former Country Club of Woodbridge property from the town to build a massive 145-unit housing development.  Arbor Haven’s sales pitch to the town rests on its claim that the town will realize a financial profit from the yearly tax revenue generated by the new homes.\n\nA cursory examination of the numbers reveals that Arbor Haven is presenting faulty math:  it turns out that the Arbor Haven proposal will actually produce a LARGE NET LOSS for the town.\n\nThe first version of the proposal, presented to the selectmen in August, based its income calculations on inaccurate estimates of school cost.  Arbor Haven projected that its development would add an additional 153 students to Woodbridge schools at a cost of $12,000 per student per year.  Of course, we all know that Woodbridge spends closer to $20,000 per student per year (a figure confirmed by the town’s finance director at the 9/8/21 selectmen’s meeting).\n\nWhen Arbor Haven was informed of the actual school expense, it came back with a revised proposal for the September 29th information session.  The per-student annual cost was revised upward to a more realistic $17,500, but oddly, the number of students had magically shrunk by half.  Presto change-o!  This maneuver would be insulting if it wasn’t so comically transparent – how stupid does Arbor Haven think we are?  The original student estimate combined with the real cost per student yields a whopping annual expense to the town of $2,677,500.\n\nIn addition to vastly undercounting the number of schoolchildren the development would produce, Arbor Haven neglected to account for the additional cost of adding adult residents to the town.  The standard multiplier used to calculate these costs (used by the town’s finance director to evaluate prior development proposals) is $2,000 per resident per year.  This covers costs like police, fire, library, roads, and general overhead.  So, if this development adds about 300 new adult residents to the town, they will create $600,000 per year in new expenses bringing the total expense of the development to $3,277,500 per year.  Since the projected tax revenue is $2,733,000 the town ends up with more than a half-million-dollar deficit every year.\n\nResidential growth creates profits for developers – it has never been, and will never be, financially beneficial to any town.  Instead of chasing this fool’s gold, the First Selectman should put her energies into growing our business sector, bringing in the type of taxpayers who actually create a net gain on the bottom line."
  },
  {
    "title": "At least Two Flaws in Arbor Haven Plan",
    "author": "Tom Weil",
    "date": "10/28/21",
    "url": "https://woodbridgetownnews.com/letter-at-least-two-flaws-in-arbor-haven-plan/",
    "content": "Proponents of the Arbor Haven plan justify their support based upon the expected receipt by the town of tax revenues (Town Tax Revenues) that will substantially exceed all costs that may be incurred by the town as a result of the development (Town Costs).  There are at least two fundamental flaws in their reasoning.\n\nFirst, it is likely that the Town Costs projected by the developer upon the build-out of the planned development are substantially understated; indeed, it is very possible that the actual Town Costs will exceed not only the developer’s Town Costs projections, thus reducing the claimed Town Tax Revenues benefits, but would actually exceed the developer’s projected Town Tax Revenues, so that the development would result in net losses to the town.\n\nEven more troubling than any misstatement of the Town Costs is the unwillingness of the developer to stand behind his Town Tax Revenue projections.  When asked directly what portion of those claimed Town Tax Revenues he would guarantee that the town would receive, he responded “None whatsoever!”  So, the town may be in the position of selling the extraordinary asset that is its largest tract of undeveloped property, and receiving not a penny of Town Tax Revenues in exchange.\n\nThe good citizens of Woodbridge cannot be so clueless as to enter into such a one-sided and unprofitable deal that would guarantee that the unique WCC property would be lost forever without any certainty of the receipt of any Town Tax Revenues in exchange – much less the amount of Town Tax Revenues projected by the developer!"
  }
]
