[
    {
      "title": "Revenue figures are inflated and not guaranteed",
      "content": "Arbor Haven's tax revenue projection of up to $2.7 million per year is flawed, inflated, and misleading because it is based on unrealistic home prices: Arbor Haven estimates values of over $700,000 for a 3-bedroom attached home on a tiny lot and a 2,000 square foot two-bedroom home at $625,000. We live in Woodbridge, not Westport. We know that these values are inflated and Arbor Haven knows it too. When asked at the info session last September how much revenue he would guarantee to the Town, the Arbor Haven CEO answered \"none whatsoever.\""
    },
    {
      "title": "School costs are under-estimated",
      "content": "Arbor Haven's initial proposal estimated an additional 153 students at a cost of $12,000 per student per year. When informed that the school expense in Woodbridge is much higher, Arbor Haven simply cut its estimated number of students in half to arrive at the same overall cost for education. The numbers don't lie. The cost of an additional 153 students using the numbers budgeted by our school boards (just under $20,000 per student per year) will be over $3 million - which is MORE than Arbor Haven's estimated annual tax revenue."
    },
    {
      "title": "Other costs are ignored",
      "content": "Arbor Haven's calculations do not include the additional cost of adding residents to the town. In evaluating prior development proposals, Woodbridge's Finance Director estimated this cost to be $2,000 per person per year. This covers expenses such as police, fire, library, roads, and general government overhead. So, if the proposed development adds even as few as 300 residents to the Town, it will create $600,000 per year in new expenses. There is no math by which the tax revenue generated by this development will offset its annual expense to the town."
    },
    {
      "title": "Beecher Road School is currently at its enrollment limit",
      "content": "According to the Woodbridge Superintendent of Schools, we are using \"every nook and cranny\" in the school building. Adding the number of students who would result from a large housing development would tip the enrollment over the school building's physical capacity, necessitating a large infrastructure project. Building an addition onto the school would cost many millions, far more than tax revenue or one-time profits from a land sale could offset."
    },
    {
      "title": "Mill rates will not decrease",
      "content": "Current debt service on the CCW property (which will end in 10 years) costs on average $382,000 per year, or about $45 per Woodbridge resident per year. Retiring this minor debt will make no noticeable difference in your tax bill. Further, there is no guarantee that the town will actually use the money from the proposed sale to retire the debt. We know this because during discussions of the last development proposal for the CCW, the Board of Finance proclaimed that \"The town does not have to pay off the debt...we could use it (the money) for another purpose\" (Board of Finance meeting, October 17, 2019)."
    },
    {
      "title": "Woodbridge zoning now allows 15 homes per acre \"by right\" at CCW site",
      "content": "Zoning regulations were radically changed last year in the wake of the multifamily housing application for 2 Orchard Road. If the Town relinquishes ownership of the CCW land, it also relinquishes the ability to control the future of that property. Arbor Haven has submitted a proposal for 145 homes, but if the Town sells the developer 100 acres, nothing could stop them from changing their proposal and building as many as 1500 homes under the new zoning rules or flipping the property to a new owner, who would be free to develop it in any way allowed by zoning."
    },
    {
      "title": "Woodbridge's own analysis shows high cost of residential development",
      "content": "Prior Town leaders have always understood that tax revenue from residential development will never exceed the expenses created by new homes. An analysis by consultants Milone & MacBroom commissioned by the town in 2014 to evaluate proposals by Toll Brothers estimated that 65 homes on the CCW would produce a $500,000 annual deficit for the town. Why is this previously accepted fact being ignored now?"
    },
    {
      "title": "Open space produces proven economic benefits",
      "content": "While the environmental, recreational, and quality of life benefits of open space preservation are obvious, the many economic benefits are less broadly understood. All the independent data show that open space creates a financial gain and residential development creates a financial loss for towns. This is one of the reasons that towns in Connecticut are purchasing open space, rather than selling it for development. (See Thomas DiNapoli, New York State Comptroller, \"Economic Benefits of Open Space Preservation,\" and Highstead Foundation, Redding, CT., \"The Economic Case for Conservation.\")"
    },
    {
      "title": "Remaining \"Open Space\" not usable",
      "content": "Arbor Haven has proposed purchasing the entire 155-acre parcel and \"gifting\" about 50 acres back to the town as \"Open Space.\" This is no gift. Most of the 50 acres are unusable since they are adjacent to the parkway or the cell tower, or so steep and rocky as to be impractical for development or recreation. This \"gift\" provides a self-serving way for Arbor Haven to get a large tax deduction and avoid annual taxes on the \"gifted\" land."
    },
    {
      "title": "Affordable housing goals not met",
      "content": "The First Selectman tries to portray the Arbor Haven proposal as a cure-all for the town's affordable housing goals. In fact, it's not even a good start. Arbor Haven's proposal provides a very small number of legally affordable homes compared to a huge number of UNAFFORDABLE homes. It makes virtually no progress toward the 10% goal, since it increases the overall number of high-priced homes in town by so many. New zoning regulations enacted last year encourage increased density and permit multifamily units throughout the town. Thus, affordable housing can be integrated into existing neighborhoods without sacrificing public open space land."
    }
  ]
  